IDEA Open Model
PolyLine2D.Segments Property
Compatible with IDEA StatiCa 20.1
 Gets segments of PolyLine2D.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public List<Segment2D> Segments { get; set; }
Public Property Segments As List(Of Segment2D)
	Get
	Set
Property Value
Type: List<Segment2D>
See Also
Reference
PolyLine2D Class
IdeaRS.OpenModel.Geometry2D Namespace